## PANDAS

Dataframe is collection of series

NaN - Not a number

In [2]:
! pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\shouv\appdata\roaming\python\python311\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\shouv\appdata\roaming\python\python311\site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\shouv\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\shouv\appdata\roaming\python\python311\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\shouv\appdata\roaming\python\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\shouv\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.1.2 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

In [5]:
pd.__version__

'2.1.1'

## Creation of Pandas Series(Column)

    Series - One dimensional Data Type in Pandas 
            Labled values in Series
                Header / Column Name
                WE can give name explicitlity using name parameter
            Index
                By Default we will get Int indexes starting from 0 to len-1
                However we can pass indexed Explicitly using index parameter

            If we are using list tuple or array no of values in these iterable should be equal to no of values in index parameter
            If we are using scalar value int,str,bool,float it will create Series according to index and fill the scalar value
            If we are using dictionary it will fill values according to the index parameter from the given dictionary

In [9]:
pd.Series(('Shouvik','Rintu','Babu'),index=['S','R','B'],name='Column_1')

S    Shouvik
R      Rintu
B       Babu
Name: Column_1, dtype: object

In [1]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [2]:
type(population_dict)

dict

In [5]:
population = pd.Series(population_dict)
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [6]:
population['California':'Florida']

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
dtype: int64

In [8]:
type(population)

pandas.core.series.Series

In [10]:
population.ndim

1

In [11]:
population.shape

(5,)

In [12]:
population.size

5

In [13]:
population.dtype

dtype('int64')

In [14]:
population['California']

38956785

In [15]:
population.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [16]:
pd.Series([2,4,6,8])  # creating series with list


# default index is created in pandas using numpy.arange(len(list))

0    2
1    4
2    6
3    8
dtype: int64

In [17]:
pd.Series((1,2,3,4))       # creating series with tuple

0    1
1    2
2    3
3    4
dtype: int64

In [18]:
import numpy as np

In [19]:
x=np.array([9,10,11,12,13])
pd.Series(x)

0     9
1    10
2    11
3    12
4    13
dtype: int32

In [20]:
pd.Series( [2,4,6] , index=[100,200,'delhi'] )               # setting up the customized index to array

100      2
200      4
delhi    6
dtype: int64

In [21]:
pd.Series( 5 )                          # creating array for a scaler value

0    5
dtype: int64

In [22]:
pd.Series( 5 , index=[100,200,300] )


# it gives preferances to the index

100    5
200    5
300    5
dtype: int64

In [23]:
pd.Series( {2:'a' ,  1:'b', 3:'c'} )

2    a
1    b
3    c
dtype: object

In [24]:
pd.Series( {2:'a' ,  1:'b', 3:'c'}, index=[3,2,4,5] )
# if key of the dictonary doesn't match with index then it will fill the series with NaN values

3      c
2      a
4    NaN
5    NaN
dtype: object

## Data Frame

In [25]:
pd.DataFrame(pd.Series([i for i in range(1,20,2)],name='Odd_numbers'))

   Odd_numbers
0            1
1            3
2            5
3            7
4            9
5           11
6           13
7           15
8           17
9           19

In [26]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

In [27]:
population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [28]:
popupation_series=pd.Series(population_dict)

In [29]:
popupation_series

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [30]:
pd.DataFrame(popupation_series)

                   0
California  38956785
Texas       26441568
New York    19555647
Florida     12364569
Illinois    12882135

In [31]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population=pd.Series(population_dict)
df = pd.DataFrame(population,columns=['population'])
df

            population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [32]:
df.shape

(5, 1)

In [33]:
df.size

5

In [34]:
df.ndim

2

In [35]:
#create a datafram for this in the below cell
city_networth = {
    'California':126789,
    'Texas':939393,
    'New York':348030340,
    'Florida':4384320,
    'Illinois':98540340
}

In [36]:
city_networth

{'California': 126789,
 'Texas': 939393,
 'New York': 348030340,
 'Florida': 4384320,
 'Illinois': 98540340}

In [37]:
# Creating the pandas DataFrame with list of the dictionries
data = [ {'a':i, 'b':i} for i in range(1,4) ]
data

[{'a': 1, 'b': 1}, {'a': 2, 'b': 2}, {'a': 3, 'b': 3}]

In [38]:
df = pd.DataFrame(data)
df

   a  b
0  1  1
1  2  2
2  3  3

In [39]:
data=[{'a': 80, 'b': 1}, {'a': 90, 'b': 2}, {'a': 95, 'b': 3}]

In [41]:
data=[
    [80,1],
    [90,2],
    [95,3]
]

In [42]:
# a customized index can be setup for a smaller DataFrame
df = pd.DataFrame(data, index=['Aditya','Vijay','Vineet'])
df

         0  1
Aditya  80  1
Vijay   90  2
Vineet  95  3

In [43]:
df.index

Index(['Aditya', 'Vijay', 'Vineet'], dtype='object')

In [44]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [45]:
df.columns[0]

0

In [46]:
# to change the names of the columns use 'df.columns=list of the new column names'
df.columns=['Excel','Rank']
df

        Excel  Rank
Aditya     80     1
Vijay      90     2
Vineet     95     3

In [47]:
# to cange the index of the DataFrame use after creating the DataFrame use 'df.index=list of the new index values'
df.index=['i','ii','iii']
df

     Excel  Rank
i       80     1
ii      90     2
iii     95     3

In [50]:
# To create a DataFrame with numpy array
import numpy as np
pd.DataFrame(np.random.rand(3,2), columns=['Class1','Class2'], index=['a','b','c'])

     Class1    Class2
a  0.150519  0.207142
b  0.542455  0.293258
c  0.316007  0.129691

In [51]:
# List of Dictionaries

d = [ 
          {'city':'Delhi','data':1000}, 
          {'city':'Mumbai','data':2000}, 
          {'city':'Bangalore','data':1500} 
     ]
pd.DataFrame(d,index=[1,2,3])

        city  data
1      Delhi  1000
2     Mumbai  2000
3  Bangalore  1500

In [11]:
pd.DataFrame([[i for i in range(1,20,2)],[i for i in range(0,21,2)]])

   0   1   2   3   4   5   6   7   8   9     10
0   1   3   5   7   9  11  13  15  17  19   NaN
1   0   2   4   6   8  10  12  14  16  18  20.0